{"title":"Help pls – XAUUSD M5 scalping keeps failing","body":"Been trying to scalp gold on M5 but my entries are always late. Losing more than winning. Any tips for faster entries? SL placement is also messy.","categorySlug":"xauusd-scalping","type":"Beginner Question","author":"forex_newbie423"}
{"title":"Grid EA on EURUSD – is 20 pip grid too tight?","body":"Running a grid EA on EURUSD with 20 pip spacing. Works in ranging markets but blows up when it trends. Should I widen the grid or add a stop loss?","categorySlug":"grid-trading-eas","type":"EA/Indicator Review","author":"grid_hunter88"}
{"title":"IC Markets vs Pepperstone for scalping","body":"Which broker is better for scalping XAUUSD? IC Markets has tighter spreads but Pepperstone has better execution. Anyone tested both?","categorySlug":"ecn-brokers","type":"Broker Review/Complaint","author":"pip_trader2024"}
{"title":"My BTCUSD scalping strategy – 500 pips in 2 weeks","body":"Finally profitable with crypto scalping! Using a simple EMA crossover on M15 timeframe. Risk management is key – never risk more than 2% per trade. Happy to share the details if anyone is interested.","categorySlug":"crypto-scalping","type":"Success Story/Journal","author":"crypto_ninja77"}
{"title":"MQL4 vs MQL5 – which should I learn first?","body":"Want to start coding my own EAs. Is MQL4 easier for beginners? Or should I jump straight to MQL5 since it's newer?","categorySlug":"mql4","type":"Beginner Question","author":"dev_learner99"}
{"title":"News scalping on NFP – best pairs to trade?","body":"NFP day is coming up. Planning to scalp the news release. EURUSD and XAUUSD are obvious choices but what about GBPUSD? Too volatile?","categorySlug":"news-scalping","type":"Strategy Discussion","author":"news_trader_x"}
{"title":"Martingale on EURUSD – lost my account again 😭","body":"Third time blowing my account with martingale. I know it's risky but the profits are so tempting when it works. Should I just quit forex?","categorySlug":"grid-martingale","type":"Beginner Question","author":"desperate_guy21"}
{"title":"Trend following EA – 70% win rate backtest","body":"Backtested a trend following EA on GBPUSD H4. 70% win rate over 2 years! Anyone interested in testing it on demo? Free to share with the community.","categorySlug":"trend-following-eas","type":"EA/Indicator Review","author":"ea_coder123"}
{"title":"XM broker blocked my withdrawal – SCAM ALERT","body":"XM is refusing to process my withdrawal. They keep asking for more documents. Been trading with them for 6 months and suddenly this happens. Avoid this broker!","categorySlug":"scam-watch","type":"Broker Review/Complaint","author":"angry_trader55"}
{"title":"Day trading USDJPY – best time of day?","body":"What's the best session to day trade USDJPY? I've heard Asian session is best but I'm in EST timezone. Should I trade during London open instead?","categorySlug":"day-trading","type":"Beginner Question","author":"yen_hunter2025"}
{"title":"Free scalping EA – tested on demo for 3 months","body":"Sharing a free scalping EA that I've been testing. It's not perfect but works on EURUSD M5. No martingale or grid, just pure scalping logic. PM me if you want it.","categorySlug":"free-eas-0","type":"EA/Indicator Review","author":"generous_coder"}
{"title":"Hedging strategy for correlated pairs","body":"Anyone using hedge strategies on EURUSD and USDCHF? They're negatively correlated so theoretically you can reduce risk. But spreads eat into profits. Worth it?","categorySlug":"hedging","type":"Strategy Discussion","author":"hedge_master_"}
{"title":"VPS recommendations for MT4 EAs","body":"Need a reliable VPS for running my EAs 24/7. Currently using ForexVPS but it's expensive. Any cheaper alternatives with low latency?","categorySlug":"vps-services","type":"Broker Review/Complaint","author":"ea_runner2024"}
{"title":"Swing trading on D1 – patience is key","body":"Finally profitable after 2 years of losing. Switched from scalping to swing trading on D1 timeframe. Less stress, better results. Sometimes slow and steady wins the race.","categorySlug":"swing-trading","type":"Success Story/Journal","author":"patient_trader"}
{"title":"Oscillator indicators – RSI vs Stochastic?","body":"Which oscillator is more reliable? RSI or Stochastic? I use both but they sometimes give conflicting signals. Should I stick to just one?","categorySlug":"oscillators-momentum","type":"Beginner Question","author":"indicator_guy88"}
{"title":"FP Markets slippage on NFP day","body":"Got 15 pips of negative slippage on FP Markets during last NFP. Is this normal? My stop loss was hit 15 pips earlier than it should have been.","categorySlug":"low-spread-brokers","type":"Broker Review/Complaint","author":"slipped_trader"}
{"title":"Position trading on W1 – holding for months","body":"Started position trading on weekly timeframe. Holding trades for 2-3 months. Much less stressful than day trading. Anyone else trading this way?","categorySlug":"position-trading","type":"Strategy Discussion","author":"longterm_bull"}
{"title":"Python trading bot for MT5 – anyone tried it?","body":"Thinking of coding a trading bot in Python instead of MQL5. Is the integration smooth? Any performance issues compared to native MQL5 EAs?","categorySlug":"python-bots","type":"Beginner Question","author":"python_lover2025"}
{"title":"Backtesting results vs forward testing – huge difference","body":"My EA had 80% win rate in backtesting but only 50% in forward testing. Is this normal? Feels like backtesting is useless if results don't match reality.","categorySlug":"backtest-results","type":"EA/Indicator Review","author":"confused_trader99"}
{"title":"Trading psychology – how to handle losing streaks?","body":"On a 10-trade losing streak. Can't focus, second-guessing every entry. How do you guys deal with this mentally? Thinking of taking a break from trading.","categorySlug":"trading-psychology","type":"Beginner Question","author":"stressed_out_trader"}
{"title":"Support and resistance indicators – do they work?","body":"Using an SR indicator that draws lines automatically. Sometimes it's spot on, other times completely wrong. Are these indicators reliable or should I draw lines manually?","categorySlug":"sr-tools","type":"EA/Indicator Review","author":"sr_trader_"}
{"title":"Exness withdrawal – instant to crypto wallet","body":"Withdrew $500 from Exness to my BTC wallet. Arrived in 10 minutes! Best broker for fast withdrawals. Highly recommend.","categorySlug":"high-leverage-brokers","type":"Broker Review/Complaint","author":"crypto_fanatic123"}
{"title":"Risk management calculator – excel vs app?","body":"Do you guys use excel spreadsheets or dedicated apps for risk management? I built my own excel calculator but wondering if there's something better.","categorySlug":"calculators-utilities","type":"Strategy Discussion","author":"math_trader2024"}
{"title":"MT4 EA keeps crashing on VPS","body":"My EA works fine on my local PC but keeps crashing on VPS. Could it be a memory issue? The VPS has 2GB RAM. Is that enough?","categorySlug":"mt4-eas","type":"Beginner Question","author":"vps_trouble_"}
{"title":"Live trading journal – XAUUSD scalping results","body":"Starting a public journal to track my XAUUSD scalping. Will post daily results. Currently at +250 pips for the month. Let's see if I can maintain this.","categorySlug":"live-trading-journals","type":"Success Story/Journal","author":"gold_scalper_pro"}
{"title":"Fundamental analysis for forex – does it matter?","body":"I only use technical analysis. Never pay attention to news or fundamentals. Am I missing out? Do fundamentals really move the market short-term?","categorySlug":"fundamental-analysis","type":"Beginner Question","author":"charts_only_guy"}
{"title":"Trade copier software – which one is best?","body":"Looking for a reliable trade copier to copy signals from my main account to multiple sub-accounts. MT4-to-MT4. Any recommendations?","categorySlug":"trade-copiers","type":"Strategy Discussion","author":"signal_provider_"}
{"title":"Regulated brokers – is FCA really better?","body":"Everyone says use FCA-regulated brokers. But I've had good experience with offshore brokers too. Is FCA regulation really worth the higher spreads?","categorySlug":"regulated-brokers","type":"Broker Review/Complaint","author":"offshore_trader2024"}
{"title":"Technical analysis course – free resources?","body":"Want to learn TA properly. Any free courses or YouTube channels you recommend? Already know the basics but want to level up.","categorySlug":"technical-analysis","type":"Beginner Question","author":"learning_trader88"}
{"title":"Breakout EA on GBPUSD – 15% monthly returns","body":"Running a breakout EA on GBPUSD for 6 months. Averaging 15% monthly returns with 10% drawdown. Should I share it with the community or keep it private?","categorySlug":"breakout-eas","type":"EA/Indicator Review","author":"breakout_master"}
{"title":"Signal services – are they worth it?","body":"Thinking of subscribing to a forex signal service. $100/month seems expensive but if it works, could be worth it. Anyone using signal services successfully?","categorySlug":"signal-services","type":"Broker Review/Complaint","author":"signal_seeker_"}
{"title":"cTrader vs MT5 – which platform is better?","body":"Been using MT4 forever. Considering switching to either cTrader or MT5. Which one has better features for automated trading?","categorySlug":"ctrader-robots","type":"Strategy Discussion","author":"platform_switcher"}
{"title":"Volume indicators on forex – do they work?","body":"I know forex is decentralized so volume isn't real volume. Are volume indicators still useful? Or just noise?","categorySlug":"volume-indicators","type":"Beginner Question","author":"volume_skeptic"}
{"title":"Market maker vs ECN brokers – huge spread difference","body":"Tested both MM and ECN brokers. MM spreads are 3-5 pips, ECN is 0.5-1 pip. But ECN charges commission. Which is more cost-effective for scalping?","categorySlug":"market-maker-brokers","type":"Broker Review/Complaint","author":"cost_conscious_"}
{"title":"Freelance EA developer needed – budget $200","body":"Need someone to code a simple EA in MQL4. Basically a moving average crossover with fixed SL/TP. Budget is $200. DM me if interested.","categorySlug":"freelance-requests","type":"Strategy Discussion","author":"hiring_trader2024"}
{"title":"Strategy backtesting – how many years is enough?","body":"Backtesting my strategy over 5 years of data. Is that enough or should I go back 10 years? More data = better results or just overfitting?","categorySlug":"strategy-backtesting","type":"Beginner Question","author":"backtest_nerd"}
{"title":"Forward test results – EA stopped working after 2 months","body":"EA worked perfectly for 2 months in forward testing, then suddenly started losing. Market conditions changed or EA is broken? How to diagnose this?","categorySlug":"forward-test-results","type":"EA/Indicator Review","author":"forward_tester_"}
{"title":"Multi-pair correlation trading – how many pairs?","body":"Trading EURUSD, GBPUSD, and AUDUSD simultaneously based on correlation. Is 3 pairs enough or should I add more? Worried about over-diversification.","categorySlug":"multi-pair-correlation","type":"Strategy Discussion","author":"correlation_trader"}
{"title":"Beginner's corner – where do I even start?","body":"Complete noob here. Opened a demo account but have no idea what I'm doing. Should I take a course first or just learn by doing? Any beginner-friendly resources?","categorySlug":"beginners-corner","type":"Beginner Question","author":"total_noob123"}
{"title":"Trend indicators – EMA vs SMA?","body":"Using moving averages for trend identification. EMA reacts faster but more false signals. SMA is slower but more reliable. Which do you prefer?","categorySlug":"trend-indicators","type":"Strategy Discussion","author":"ma_enthusiast"}
{"title":"EA performance reports – how to analyze them?","body":"My EA generated a huge performance report with 1000+ trades. How do I analyze this data? What metrics should I focus on besides win rate?","categorySlug":"ea-performance-reports","type":"Beginner Question","author":"report_reader_"}
{"title":"Template packs for MT4 – any good free ones?","body":"Looking for free MT4 template packs. Already have the default templates but want something more professional-looking with better indicator setups.","categorySlug":"template-packs","type":"EA/Indicator Review","author":"template_hunter"}
{"title":"MT5 EA development – is it harder than MQL4?","body":"Learned MQL4 pretty well. Considering learning MQL5 but heard it's more complex. Is the learning curve steep? Worth the effort?","categorySlug":"mt5-eas","type":"Strategy Discussion","author":"mql5_curious_"}
{"title":"Budget EA – found one for 75 coins, worth it?","body":"Saw a budget EA listed for 75 coins. Looks promising from the description but no reviews yet. Should I risk it or wait for reviews?","categorySlug":"budget-eas-50-100","type":"EA/Indicator Review","author":"bargain_hunter88"}
{"title":"Premium EA – 400 coins but lifetime updates","body":"Considering buying a premium EA for 400 coins. It's expensive but includes lifetime updates and support. Anyone bought premium EAs? Worth the investment?","categorySlug":"premium-eas-200-500","type":"Broker Review/Complaint","author":"premium_buyer_"}
{"title":"News trading EA – does it even work?","body":"Heard about EAs that trade news releases automatically. Sounds too good to be true. Anyone actually profitable with news trading EAs?","categorySlug":"news-trading-eas","type":"EA/Indicator Review","author":"news_skeptic2024"}
{"title":"Risk management – how much per trade?","body":"Everyone says 1-2% per trade. But with small accounts, 1% is just $10. How do you guys manage risk with accounts under $1000?","categorySlug":"risk-management","type":"Beginner Question","author":"small_account_guy"}
{"title":"Tickmill review – solid broker for beginners","body":"Been using Tickmill for 3 months. No issues with withdrawals, spreads are competitive, and customer support is helpful. Good choice for beginners.","categorySlug":"ecn-brokers","type":"Broker Review/Complaint","author":"tickmill_fan"}
{"title":"ASIC regulation – is it as good as FCA?","body":"Most people talk about FCA regulation. But what about ASIC? Australian brokers seem solid too. Is ASIC as reliable as FCA?","categorySlug":"regulated-brokers","type":"Strategy Discussion","author":"aussie_trader2024"}
{"title":"Grid trading – lost $2k in 1 week","body":"Tried grid trading on EURUSD. Worked great for 2 weeks then lost everything in 1 week when price trended hard. Grid trading is too risky. Stick to traditional strategies.","categorySlug":"grid-martingale","type":"Success Story/Journal","author":"grid_victim_"}
{"title":"Scalping EAs – do any actually work long-term?","body":"Tested 10+ scalping EAs. They all work for a few weeks then blow up. Is there any scalping EA that's profitable long-term? Or is it all hype?","categorySlug":"scalping-eas","type":"EA/Indicator Review","author":"ea_skeptic2025"}
{"title":"Day trading EURUSD – London session best?","body":"Trading EURUSD during London session (8am-12pm GMT). Most action happens here. Anyone trading other sessions successfully?","categorySlug":"day-trading","type":"Strategy Discussion","author":"london_trader_"}
{"title":"Swing trading – closed 3 trades this week, all winners","body":"Swing trading update: Closed 3 trades this week, all winners. Total +450 pips. Patience really pays off in swing trading. Not as exciting as scalping but more consistent.","categorySlug":"swing-trading","type":"Success Story/Journal","author":"swing_king2024"}
{"title":"Position trading on gold – holding for 6 months","body":"Entered a long position on XAUUSD 6 months ago at $1800. Still holding at $2050. Position trading requires nerves of steel but the profits are worth it.","categorySlug":"position-trading","type":"Success Story/Journal","author":"gold_bull_"}
{"title":"Hedging strategy – how to calculate position sizes?","body":"Want to hedge EURUSD with USDCHF. How do you calculate the position sizes to balance the hedge? Equal lots or need to adjust for correlation strength?","categorySlug":"hedging","type":"Beginner Question","author":"hedge_newbie88"}
{"title":"Python bot vs MQL5 EA – which is faster?","body":"Coded the same strategy in both Python and MQL5. Python bot has slight delay in execution. MQL5 EA is instant. Is this latency a deal-breaker for scalping?","categorySlug":"python-bots","type":"Strategy Discussion","author":"speed_tester_"}
{"title":"Beginner question – what is leverage?","body":"Keep hearing about leverage but don't fully understand it. Is 1:500 leverage dangerous? Should beginners use low leverage like 1:50?","categorySlug":"beginners-corner","type":"Beginner Question","author":"confused_newbie2024"}
